const question = document.querySelector('.quiz__q');
const answer = document.querySelector('.quiz__a');
const btn = document.querySelector('.quiz__b');


let previous = 0;
let current;


const test = {
    1: {
        q: 'متنبه شدن',
        a: "به زشتی عمل خود پی بردن و پند گرفتن"
    }, 
    2: {
        q: "مخیله",
        a: "خیال، قوه تخیل، ذهن"
    },
    3: {
        q: 'معمر',
        a: 'سالخورده'
    },
    4: {
        q: 'افسرده',
        a: 'بی بهره از معنویت، بی ذوق و حال'
    },
    5: {
        q: 'جبین',
        a: 'پیشانی'
    },
    6: {
        q: 'روایی',
        a: 'ارزش، اعتبار'
    },
    7: {
        q: 'اخته',
        a: 'بیرون کشیده، برکشیده'
    },
    8: {
        q: 'سرحد',
        a: 'مرز، کرانه'
    },
    9: {
        q: 'غایی',
        a: 'منسوب به غایت، نهایی'
    },
    10: {
        q: 'ابهن',
        a: 'بزرگی و شکوه که سبب احترام یا ترس دیگران میشود'
    },
    11: {
        q: 'اعلان',
        a: 'اشکار کردن چیزی و باخبر ساختن مردم از ان'
    },
    12: {
        q: 'اهتمام',
        a: 'کوشش، سعی، همت گماشتن;اهتام ورزیدن درکاری: همت گماشتن به انجام دادن ان'
    },
    13: {
        q: 'بیشه',
        a: 'زمینی که در ان به طور طبیعی گیاهان خودرو و درخت روییده باشد'
    },
        14: {
        q: 'تناور',
        a: 'دارای پیکر بزرگ و قوی'
    },
    15: {
        q: 'جلی',
        a: 'ویژگی خطی که درشت و واضح باشد و از دور دیده شود'
    },
    16: {
        q: 'سجایا',
        a: 'ج سجیه، خوها، خلق ها و خلصت ها'
    },
    17: {
        q: 'صحیفه',
        a: 'کتاب'
    },
    18: {
        q: 'عتاب',
        a: 'سرزنش، ملامت، تندی'
    },
    19: {
        q: 'بدقواره',
        a: 'ان که یا انچه که ظاهری زشت و نامتناسب دارد، بدترکیب'
    },
    20: {
        q: 'بذله',
        a: 'شوخی، لطیفه'
    },
    21: {
        q: 'برجک',
        a: 'سازه چرخانی که روی تانک قرار دارد و به کمک ان می توان جهت شلیک توپ را تغییر داد'
    },
    22: {
        q: 'بقولات',
        a: 'انواع دانه های خوراکی بعضی گیاهان مانند نخود و عدس، حبوبات'
    },

        23: {
        q: 'بلامعارض',
        a: 'بی رقیب'
    },
    24: {
        q: 'بلعت',
        a: 'فروبردم، بلعیدم; صرف کردن صیغه بلعت: خوردن'
    },
    25: {
        q: 'پاپی شدن',
        a: 'در امری اصرار ورزیدن'
    },
    26: {
        q: 'پتیاره',
        a: 'زشت و ترسناک'
    },

    27: {
        q: 'ترفیع',
        a: 'ارتقایافتن، رتبه گرفتن'
    },
    28: {
        q: 'تصدیق',
        a: 'تایید کردن درستی حرف یا عملی، گواهی دادن به صحت امری'
    },
    29: {
        q: 'تصنعی',
        a: 'ساختگی'
    },
    30: {
        q: 'نک و پوز',
        a: 'دک و پوز، به طنر، ظاهر شخص به ویژه سروصورت'
    },
    31: {
        q: 'چلمن',
        a: 'ان که زود فریب میخورد، هالو; بی عرضه، دست و پا چلفتی'
    },
    32: {
        q: 'حضار',
        a: 'انان که در جایی مجلسی حضور دارن; حاضران'
    },
    33: {
        q: 'خرت و پرت',
        a: 'مجموعه ای از اشیا، وسایل و خرده ریزه های کم ارزش'
    },
    34: {
        q: 'خورد رفتن',
        a: 'ساییده شدن و از بین رفتن'
    },
    35: {
        q: 'خمره',
        a: 'ظرفی به شکل خم و کوچیک تر از ان '
    },
    36: {
        q: 'خفایا',
        a: 'ج خفیه، مخفیگاه; در خفایای ذهن: در جاهای پنهان ذهن'
    },
    37: {
        q: 'خوش مشربی',
        a: 'خوش مشرب بودن; خوش معاشرتی و خوش صحبتی'
    },
    38: {
        q: 'درزی',
        a: 'خیاط'
    },
    39: {
        q: 'دوری',
        a: 'بشقاب گرد بزرگ معمولا با لبه کوتاه'
    },
    40: {
        q: 'دیلاق(من)',
        a: 'دراز و لاغر'
    },

}



function reveval() {
    answer.textContent = test[current].a
    btn.textContent = 'Next';
}

function setup() {
    answer.textContent = '...';
    btn.textContent = 'Answer?';
    let random = Math.ceil(Math.random() * Object.keys(test).length);
    while(random == previous) {
        random = Math.ceil(Math.random() * Object.keys(test).length);
    }
    current = random;
    
    question.textContent = test[current].q;

    previous = current;
}

setup();



btn.addEventListener('click', () => {
    if(btn.textContent == 'Answer?') {
        reveval();
    } else {
        setup();
    }
})